{
  "tips": [
    "HMCL was originally made by huanghongxun; more contributors later joined.",
    "Minecraft’s first version launched in 2009 as a simple prototype.",
    "Every horse in Minecraft has a random unique speed.",
    "Name a Vindicator \"Johnny\" to make it very aggressive.",
    "HMCL’s dev community is active (new features often added); follow GitHub discussions.",
    "HMCL works on Windows, MacOS and Linux.",
    "HMCL devs share progress/plans on Bilibili and GitHub.",
    "Iron Golems give Poppies to Copper Golems, which then wear them.",
    "Endermen lose teleport if trapped in a minecart or cobweb.",
    "Creepers started as a pig glitch in the game.",
    "Skip sleep for 3 in-game days? Be careful on day 4’s night.",
    "1/256 chance to get 4 chicks from one egg.",
    "Golden Pickaxe has low durability but high good enchant chance.",
    "Ocelots and Iron Golems take no fall damage—they can’t die from falling.",
    "Falling on hay bales reduces fall damage.",
    "Early Minecraft let you mine coal ore with bare hands.",
    "Chests turn into gift box textures at Christmas.",
    "Cats sit on beds, chests and furnaces automatically.",
    "Endermen are the only mobs spawning naturally in all 3 Minecraft dimensions.",
    "Banners sway in the Overworld, not in the Nether/End.",
    "Minecraft’s \"tick\" = 0.05s; 1 in-game day = 24,000 ticks (20 mins).",
    "Tropical Fish: 2 sizes, 6 patterns each, 15 base/pattern colors—2,700 total types.",
    "Name a sheep \"jeb_\" to make it rainbow-colored.",
    "Skeletons have 21% left-hand bow use (based on real human data).",
    "Skeletons attack from any angle—turning away won’t stop them.",
    "Test horse speed: Two riders, leashed together, pull opposite—loser’s horse is slower.",
    "Hit squids’ heads, not tentacles—tentacles take no damage.",
    "Adult turtles avoid undead unless the undead hated them as babies.",
    "Jungle Temples always use 1,185 cobblestone or mossy cobblestone.",
    "Enchant shields with Unbreaking/Mending via anvil, not enchantment table."
  ]
}